# // ჩვენ უნდა გვქონდეს 3 ინფუთი საიდანაც შემოიტანს მომხმარებელი სახელს, გვარს, ასაკს და ღილაკი რომელიც შექმნის ამ ყველაფრიდან ობიექტს, ეს ყველაფერი უნდა გამოსახოთ გვერძე ფანჯარაში(სახელი გვარი ასაკი), ასევე უნდა გქონდეთ ერთი ფანჯარა საიდანაც მომხმარებელი შემოიტანს დროში მოგზაურობის დროს თუ რამდენი ხნით სურს დროში მოგზაურობა, და ასევე იქვე იქნება ღილაკი რომელზე დაჭერის შემთხვევაშიც უნდა გამოიძახოს ობიექტის მეთოდი, და იქვე დაიწეროს რომ დროში მოგაზაურობის შემდეგ 11, 10, სახელი გვარი  შენ იქნები 10 წლის შემდეგ 21 წლის

from tkinter import *
from tkinter import messagebox

class User:
    def __init__(self, name, surname, age):
        self.name = name
        self.surname = surname
        self.age = age

    def birthday(self, years):
        self.age += years


            