# for i in range(1, 11):
#     print(i)

# # ----------------------------------------------------------
# total = 0
# for i in range(1, 11):
#     total += i
# print("ჯამი:", total)

# # ----------------------------------------------------------

# for i in range(0, 20, 2):
#     print(i)
# # ----------------------------------------------------------

# fruits = ["ანანია", "ბანანი", "ბარგარი", "მსხალი"]
# for fruit in fruits:
#     print("მე მიყვარს", fruit)

# # ----------------------------------------------------------

# for i in range(1, 21):
#     if i % 2 == 0:
#         print(i, "ლუწია")
#     else:
#         print(i, "კენტია")

# # ----------------------------------------------------------

# i = 1
# while i <= 10:
#     print(i)
#     i += 1
# # ----------------------------------------------------------
# secret_number = 7
# guess = 0
# while guess != secret_number:
#     guess = int(input("გთხოვთ, გამოიცნოთ რიცხვი (1-10): "))
# print("ბრavo! თქვენ გამოიცანით.")

# # ----------------------------------------------------------
# count = 0
# while count < 10:
#     print("ეს არის გაწვდილი", count)
#     count += 1
# # ----------------------------------------------------------

# i = 1
# while i <= 5:
#     print("რიცხვი:", i)
#     i += 1

# # ----------------------------------------------------------
# total = 0
# number = -1  # წარადგენს რომელიმე რიცხვს, რომელიც არ იქნება 0-ზე ნაკლები

# while number != 0:
#     number = int(input("შეიყვანეთ რიცხვი (0 ჩასატარებლად): "))
#     total += number

# print("ჯამი:", total)
