#davaleba 1-2
# Tuple:

# Immutable (უცვლელი): Tuple არის მონაცემთა სტრუქტურა, რომლის შიგთავსი შეცვლას არ ექვემდებარება. ამიტომ ის უფრო უსაფრთხოა და ხშირად გამოიყენება ისეთ სიტუაციებში, სადაც მონაცემები არ უნდა შეიცვალოს.
# Performance (სწრაფი შესრულება): Tuple უფრო სწრაფია შედარებით List-თან, რადგან მისი ზომა და შიგთავსი უცვლელია.
# გადამუშავება და წვდომა: გამოიყენება მონაცემთა მუდმივ კოლექციებში, როგორიცაა კოორდინატები (x, y) ან მრავალფეროვანი კონფიგურაციის პარამეტრები.
# Set:

# Unique Elements (უნიკალური ელემენტები): Set ავტომატურად შლის დუპლიკატებს და ინახავს მხოლოდ უნიკალურ მნიშვნელობებს.
# Mathematical Operations (მათემატიკური ოპერაციები): Set-ის საშუალებით მარტივად შეგვიძლია მოვახდინოთ ოპერაციები, როგორიცაა გაერთიანება, გადაკვეთა და სხვაობა.
# Unordered Collection (უხარისხო კოლექცია): Set-ში ელემენტების თანმიმდევრობა არ არის დაცული.